export function initializeUserSession() {
  if (!sessionStorage.getItem("users")) {
    sessionStorage.setItem(
      "users",
      JSON.stringify([
        {
          username: "User123",
          email: "user@example.com",
          gender: "Машки",
          year: "1999",
        },
        {
          username: "User456",
          email: "user2@example.com",
          gender: "Женски",
          year: "1996",
        },
        {
          username: "User789",
          email: "user3@example.com",
          gender: "Машки",
          year: "2002",
        },
      ])
    );
  }
}

export const informationCardsInfo = [
  {
    id: 1,
    title: "Лоши навики при “Live streaming”",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "mostWatched",
  },
  {
    id: 2,
    title: "Праќање на звучни пораки",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "mostWatched",
  },
  {
    id: 3,
    title: "Безбедност при користење на апликации",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "relevantNews",
  },
  {
    id: 4,
    title: "Различни уреди, различни проблеми",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "relevantNews",
  },
  {
    id: 5,
    title: "Што се случува во позадина додека сурфаш",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "relevantNews",
  },
  {
    id: 6,
    title: "Што e важно во додека снимаш некој друг",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "relevantNews",
  },
  {
    id: 7,
    title: "Безбедност онлајн и офлајн",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "newestNews",
  },
  {
    id: 8,
    title: "Компјутерски вируси",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "mostWatched",
  },
  {
    id: 9,
    title: "Како да (не) го користиш Инстаграм",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "mostWatched",
  },
  {
    id: 10,
    title: "Споделување на содржини",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "newestNews",
  },
  {
    id: 11,
    title: "Хакерски напади",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "newestNews",
  },
  {
    id: 12,
    title: "Ризици при работење преку интернет",
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард",
    date: "Објавено на 28/05/23",
    image: "images/Rectangle 540.png",
    category: "newestNews",
  },
];

export const discussionCardsInfo = [
  {
    content:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга.",
    color: "#4B7CF3",
  },
  {
    content:
      "Се верува дека Лорем ипсум настанал во 45 година пред нашата ера, што го прави повеќе од 2000 години стар.",
    color: "#8F39EC",
  },
  {
    content:
      "Се користел како стандарден модел на текст во печатарството и типографијата уште од 1500 година.",
    color: "#83EAB1",
  },
  {
    content:
      "Лорем ипсум го преживеал не само пет века, туку и преминот кон електронска типографија.",
    color: "#764FF0",
  },
  {
    content:
      "Останал релативно непроменет во текот на овие векови, а популаризиран е во 1960-тите со издавањето на Letraset листовите кои содржеле Lorem Ipsum пасуси.",
    color: "#4B7CF3",
  },
  {
    content:
      "Содржи не само повеќе од 200 латински зборови, туку и многу специфични граматички конструкции. Лорем ипсум го користеле не само печатарите, туку и веб дизајнерите како модел на текст при изработка на веб страници. Овој текст е многу практичен за тестирање на дизајнот, бидејќи има реална должина и структура на зборовите и речениците.",
    color: "#8F39EC",
  },
  {
    content:
      "Оригиналниот текст на Lorem Ipsum доаѓа од дел 1.10.32 и 1.10.33 од делата на Цицерон, написани во 45 година пред нашата ера. Првата линија од Lorem Ipsum, 'Lorem ipsum dolor sit amet...', доаѓа од дел 1.10.32. Лорем ипсум текстот се користи за да покаже изглед и распоред на текстот без да го одвлекува вниманието на читателот.",
    color: "#83EAB1",
  },
  {
    content:
      "Првата линија од Lorem Ipsum, 'Lorem ipsum dolor sit amet...', доаѓа од дел 1.10.32.",
    color: "#764FF0",
  },
  {
    content:
      "Во текот на вековите, појавиле се многу верзии на Lorem Ipsum, понекогаш случајно, а понекогаш намерно (внесувајќи хумор и слично). Лорем ипсум е текст кој има долга и интересна историја. Првично бил користен во печатарството, а потоа се проширил и во дигиталните медиуми. Текстот е познат по својата флексибилност и способност да се прилагоди на различни дизајни и распоред.",
    color: "#4B7CF3",
  },
  {
    content:
      "Многу десктоп издавачки програми и веб уредници сега користат Lorem Ipsum како стандарден модел на текст.",
    color: "#8F39EC",
  },
  {
    content:
      "Lorem Ipsum е познат по својата неутралност, што го прави идеален за тестирање на изгледи и распоред. Овој текст го користат не само професионалци, туку и аматери при изработка на своите проекти. Лорем ипсум има важна улога во светот на графичкиот дизајн. Тој е едноставен, лесен за употреба и одличен за визуелизација на крајниот резултат.",
    color: "#83EAB1",
  },
  {
    content:
      "Текстот на Lorem Ipsum се користи како заштитен знак за да укаже дека документот е примерок. Ова е многу корисно во процесот на изработка на дизајн, бидејќи овозможува да се тестираат различни аспекти на изгледот без да се користи реален текст. На овој начин, дизајнерите можат да се фокусираат на визуелните елементи и функционалноста.",
    color: "#764FF0",
  },
  {
    content:
      "Lorem Ipsum содржи фрагменти од класични дела од латинската литература, кои датираат од пред повеќе од 2000 години.",
    color: "#4B7CF3",
  },
  {
    content:
      "Текстот на Lorem Ipsum не само што има долга историја, туку е и популаризиран во модерната типографија. Лорем ипсум е стандарден текст кој се користи за преглед на изгледот на документите пред тие да бидат финализирани. Овој текст е познат по својата едноставност и флексибилност. Многу дизајнери го користат Лорем ипсум за да добијат реалистичен преглед на изгледот на своите проекти.",
    color: "#8F39EC",
  },
  {
    content:
      "Lorem Ipsum е станат стандарден модел на текст за печатарската индустрија уште од 1500 година.",
    color: "#83EAB1",
  },
  {
    content:
      "Денес, Lorem Ipsum е познат по својата неутралност, што го прави идеален за тестирање на изгледи и распоред на текст.",
    color: "#764FF0",
  },
  {
    content:
      "Lorem Ipsum текстот се користи како стандарден модел во печатарството и типографијата уште од 1500 година.",
    color: "#4B7CF3",
  },
  {
    content:
      "Lorem Ipsum е користен како стандарден модел на текст во печатарството уште од 1500 година. Во денешно време, тој е користен не само од печатари, туку и од веб дизајнери, маркетинг експерти и други професионалци кои се занимаваат со создавање на визуелни содржини. Лорем ипсум помага во процесот на креирање на дизајни и го олеснува тестирањето на различни елементи на изгледот.",
    color: "#8F39EC",
  },
  {
    content:
      "Lorem Ipsum бил индустриски стандард кој се користел како модел уште пред 1500 години.",
    color: "#83EAB1",
  },
  {
    content:
      "Lorem Ipsum бил популаризиран во 1960-тите со издавањето на Letraset листовите кои содржеле Lorem Ipsum пасуси. Овие листови биле користени од многу дизајнери и печатари за да создадат примероци на дизајни и распоред на текст. Популарноста на Лорем ипсум продолжува и денес, со неговата употреба во дигиталните медиуми и веб дизајнот.",
    color: "#764FF0",
  },
  {
    content:
      "Многу десктоп издавачки програми и веб уредници сега користат Lorem Ipsum како стандарден модел на текст.",
    color: "#4B7CF3",
  },
  {
    content:
      "Lorem Ipsum го преживеал не само пет века, туку и преминот кон електронска типографија.",
    color: "#8F39EC",
  },
  {
    content:
      "Се верува дека Lorem Ipsum настанал во 45 година пред нашата ера, што го прави повеќе од 2000 години стар.",
    color: "#83EAB1",
  },
];
